# Assingment

1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [2]:
#1. info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [3]:
#2. describe
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
# 3. head()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# 4. tail()
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
# 5. dtypes
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
import numpy as np

dictg = {'A': list(np.arange(0,10)),
        'B': list(np.arange(10,20)),
        'C': list(np.arange(30,40))
        }

df1 = pd.DataFrame(dictg)

In [8]:
import pandas as pd

def reindex_with_incremented_index(df):
    new_index = range(1, len(df) * 2, 2)
    df.index = new_index
    return df

reindex_with_incremented_index(df1)

    A   B   C
1   0  10  30
3   1  11  31
5   2  12  32
7   3  13  33
9   4  14  34
11  5  15  35
13  6  16  36
15  7  17  37
17  8  18  38
19  9  19  39

3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [9]:
dictg = {'Values': list(np.arange(60,400,36))}
df2 = pd.DataFrame(dictg)
df2

   Values
0      60
1      96
2     132
3     168
4     204
5     240
6     276
7     312
8     348
9     384

In [10]:
def sum_of_3(df):
    suma = df['Values'][0:3].sum()
    print(suma)
    
sum_of_3(df2)

288

4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [11]:
import pandas as pd

def add_word_count_column(df):
    # Split the 'Text' column into words and count them
    word_counts = df['Text'].str.split().str.len()
    
    # Add the new 'Word_Count' column to the DataFrame
    df['Word_Count'] = word_counts
    
    # Return the updated DataFrame
    return df

5. How are DataFrame.size() and DataFrame.shape() different?

- Size: show the total number of elements in the dataframe, rows multiplied by columns.
- Shape: show the dimensions of the dataframe, number of rows and number of columns.

Q6. Which function of pandas do we use to read an excel file?

- We use pd.read_excel()

7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.\
\
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [35]:
emails = {'emails': ['jesus.soto@pucp.com','jesusoen2512@gmail.com']}
ema = pd.DataFrame(emails)
ema

                   emails
0     jesus.soto@pucp.com
1  jesusoen2512@gmail.com

In [36]:
ema['Username'] = ema.emails.str.split('@', expand=True)[0]

In [37]:
ema

                   emails      Username
0     jesus.soto@pucp.com    jesus.soto
1  jesusoen2512@gmail.com  jesusoen2512

8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [38]:
dicc = {'A': [3,8,6,2,9], 'B':[5,2,9,3,1],'C': [1,7,4,5,2]}
datos = pd.DataFrame(dicc)
datos

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [44]:
def filtro(datos):
    data2 = datos[(datos.A > 5) & (datos.B < 10)]
    return data2

In [45]:
filtro(datos)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [48]:
def estadisticas(df ,col  ):
    val_mean = df[col].mean()
    val_med =    df[col].median()
    val_std = df[col].std()
    
    print(f'Mean: {val_mean}\nMedian: {val_med}\nStd: {val_std} ')

In [49]:
estadisticas(datos, 'A')

Mean: 5.6
Median: 6.0
Std: 3.0495901363953815

10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [ ]:
def add_moving_average(df):
    # Sort the DataFrame by date
    df = df.sort_values(by='Date')

    # Calculate the moving average using a rolling window of size 7
    ma = df['Sales'].rolling(window=7, min_periods=1).mean()

    # Add the moving average as a new column
    df['MovingAverage'] = ma

    return df

11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [64]:
fechas = {'Date': ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2022-05-24','2023-08-04']}
datos3 = pd.DataFrame(fechas)
datos3

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2022-05-24
6  2023-08-04

In [65]:
def add_weekday(df):
    # Convert the 'Date' column to a datetime object
    df['Date'] = pd.to_datetime(df['Date'])

    # Extract the weekday name from the 'Date' column and add it as a new column
    df['Weekday'] = df['Date'].dt.day_name()

    return df

In [66]:
add_weekday(datos3)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2022-05-24    Tuesday
6 2023-08-04     Friday

12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [68]:
def filtro_fecha(data,fecha_1, fecha_2):
    data6 = data[(datos3.Date >= fecha_1) & (data.Date <=fecha_2)]
    return data6

filtro_fecha(datos3, '2023-01-01','2023-01-31')

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [69]:
#the necessary library is pandas
import pandas as pd